from src.services import beneficial_cashback


sender1 = {'Услуги банка': 19.49, 'Супермаркеты': 123.69, 'Связь': 12.0, 'Транспорт': 35.0, 'Различные товары': 16.48,
           'Ж/д билеты': 14.27, 'Рестораны': 75.59, 'Фастфуд': 45.72, 'Пополнения': 602.06, 'Наличные': 154.38,
           'Переводы': 696.19, 'Отели': 28.06, 'Одежда и обувь': 27.08, 'Образование': 2.88, 'Сервис': 1.87,
           'Сувениры': 0.73, 'Бонусы': 7.47, 'Аптеки': 4.62, 'Красота': 11.3, 'Топливо': 2.78, 'НКО': 10.0,
           'Другое': 295.67, 'Финансы': 15.96}


sender2 = {'Пополнения': 2225.0, 'Услуги банка': 0.59, 'Супермаркеты': 64.55, 'Транспорт': 25.9, 'Связь': 5.65,
           'Топливо': 9.13, 'Фастфуд': 7.6, 'Переводы': 603.1, 'Медицина': 9.2, 'Бонусы': 0.1,
           'Наличные': 315.0, 'Красота': 2.94, 'ЖКХ': 84.39, 'Аптеки': 1.93, 'Дом и ремонт': 9.98,
           'Цветы': 0.5, 'Спорттовары': 4.98}


def test_beneficial_cashback1():
    year = '2018'
    month = '05'
    assert beneficial_cashback(year, month) == sender1


def test_beneficial_cashback2():
    year = '2020'
    month = '08'
    assert beneficial_cashback(year, month) == sender2
